// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Chrome OS छवि निर्माता के बारे में";
"Menu Prefs" = "प्राथमिकताएं..";
"Menu Services" = "सेवाएं";
"Menu Hide" = "Chrome OS छवि निर्माता छुपाएं";
"Menu Hide Others" = "अन्य को छुपाएं";
"Menu Show All" = "सभी दिखाएं";
"Menu Quit" = "Chrome OS छवि निर्माता से बाहर जाएं";
"Menu Window" = "विंडो";
"Menu Minimize" = "छोटा करें";
"Menu Zoom" = "ज़ूम करें";
"Menu Bring All To Front" = "सभी को सामने लाएं";
"Menu Help" = "सहायता";
"Menu App Help" = "Chrome OS छवि निर्माता सहायता";

/* Buttons */
"Button Previous" = "पिछला";
"Button Next" = "अगला";
"Button Stop" = "रोकें";
"Button Done" = "पूर्ण";

/* Tab: Select device model */
"Text Welcome" = "यह टूल आपको अपने Chrome OS उपकरण को पुनर्स्थापित करने के लिए पुनर्प्राप्ति SD कार्ड या USB मेमोरी स्टिक बनाने देता है.\n\nअपने Chrome OS उपकरण का मॉडल नंबर दर्ज करें (उदा. SAMS ALEX BETA-US 8738). यह स्‍क्रीन पर नीचे प्रदर्शित होता है जो आपको पुनर्प्राप्ति उपकरण से कनेक्‍ट होने का संकेत देता है.";
"Text Model" = "मॉडल:";
"Button Local Image" = "स्थानीय छवि…";

/* Tab: Select USB stick */
"Text Select Prompt" = "पुनर्प्राप्ति के लिए पुनर्प्राप्ति संग्रहण उपकरण का चयन करें:";
"Text Insertion Prompt" = "कृपया SD कार्ड या USB मेमोरी स्टिक लगाएं.";

/* Tab: Done */
"Text Congrats" = "आपका मीडिया तैयार है. अब आप उसे अपने सिस्‍टम से निकाल सकते हैं और उसका उपयोग अपने Chrome OS उपकरण को पुनर्स्थापित करने के लिए कर सकते हैं.";

/* Sizes */
"Size Bytes" = " बाइट";
"Size Kilobytes" = " KB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "यह ऐप्लिकेशन नहीं चलाई जा सकती.";
"NoDiskArb Informative" = "डिस्क आर्बिट्रेशन प्रारंभ करने में कोई त्रुटि थी. ऐसा नहीं होना चाहिए.";
"NoDiskArb OK" = "ठीक";

/* Error retrieving config file. */
"CantGetConfig Message" = "छवियों की सूची पुनर्प्राप्त नहीं की जा सकती.";
"CantGetConfig Informative" = "उपलब्ध पुनर्प्राप्ति छवियों (%1$@) की सूची प्राप्त करने में समस्या आ रही थी. कृपया यह सुनिश्चित करने के लिए देखें कि आपका नेटवर्क कनेक्शन कार्य कर रहा है.";
"CantGetConfig OK" = "ठीक";
"CantGetConfig Error NoConnection" = "कनेक्शन आवंटित नहीं किया जा सका";
"CantGetConfig Error DownloadError" = "डाउनलोड के दौरान कोई त्रुटि आई";
"CantGetConfig Error StringCreate" = "प्रतिसाद का उपयोग नहीं किया जा सका";

/* Version error. */
"VersionError Message" = "ऐप्लिकेशन का यह संस्करण बहुत पुराना है.";
"VersionError Informative" = "कृपया नया संस्करण डाउनलोड करें. यह %1$@ संस्करण है; कम से कम %2$@ संस्करण आवश्यक है. %3$@";
"VersionError OK" = "नया संस्करण प्राप्त करें";

/* File dialog to select a local file. */
"SelectLocal File" = "कृपया किसी छवि का चयन करें:";
"SelectLocal Button" = "चयन करें";

/* Alert on writing stick. */
"WriteAlert Message" = "क्या आप वाकई %1$@? को स्थायी रूप से  मिटाना चाहते हैं?";
"WriteAlert Informative" = "इसमें वर्तमान में मौजूद सभी डेटा स्थायी रूप से खो जाएंगे. आप इस क्रिया को पूर्ववत नहीं कर सकते.";
"WriteAlert Cancel" = "मिटाएं नहीं";
"WriteAlert OK" = "मिटाएं";

"TooSmallAlert Message" = "%1$@ का उपयोग नहीं किया जा सकता; यह बहुत छोटी है.";
"TooSmallAlert Informative" = "कम से कम %2$@ के SD कार्ड या USB मेमोरी स्टिक की आवश्‍यकता है.";
"TooSmallAlert OK" = "ठीक";

"NotWritable Message" = "%1$@ का उपयोग नहीं किया जा सकता; यह केवल पढ़ने के लिए है.";
"NotWritable Informative" = "SD कार्ड या USB मेमोरी स्टिक केवल पढ़ने के लिए है. उसमें लिखने की अनुमति देने के लिए उस पर एक स्विच हो सकता है; अन्‍यथा उसका उपयोग नहीं किया जा सकता.";
"NotWritable OK" = "ठीक";

"Label SD Card" = "SD कार्ड";

/* Stick writing statuses. */
"Status Downloading" = "डाउनलोड हो रहा है…";
"Status Verifying Image" = "पुनर्प्राप्ति छवि सत्‍यापित की जा रही है…";
"Status Unpacking" = "अनपैक हो रहा है…";
"Status Claiming" = "दावा किया जा रहा है…";
"Status Unmounting" = "अनमाउंट हो रहा है…";
"Status Writing" = "लिखा जा रहा है…";
"Status Verifying Media" = "पुनर्प्राप्ति मीडिया सत्‍यापित किया जा रहा है…";
"Status Ejecting" = "निकाला जा रहा है…";
"Status Done" = "पूर्ण!";

"StatusAdd Attempt" = " (प्रयास %1$d)";

/* Errors */
"Failure Downloading" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि डाउनलोड करने में विफल). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Verifying Return Value" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि सत्यापित करने में विफल, प्रोग्राम विफलता, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Verifying SHA Mismatch" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि सत्यापित करने में विफल, चैकसम विफलता). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Unpacking" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि अनपैक करने में विफल, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Claiming" = "क्षमा करें, कोई त्रुटि आई (USB स्टिक पर दावा करने में विफल). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Unmounting" = "क्षमा करें, कोई त्रुटि आई (USB स्टिक अनमाउंट करने में विफल). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Opening Source Image" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि खोलने में विफल, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Opening Destination Device" = "क्षमा करें, कोई त्रुटि आई (USB स्टिक खोलने में विफल, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";"Failure Reading Source Image" = "क्षमा करें, कोई त्रुटि आई (स्रोत छवि अनपैक करने में विफल, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Writing Destination Device" = "क्षमा करें, कोई त्रुटि आई (USB स्टिक में डेटा लिखने में विफल, %1$s). क्या आप पुन: प्रयास करना चाहते हैं?";
"Failure Reading Destination Device" = "क्षमा करें, कोई त्रुटि हुई (USB स्टिक, %1$s से पढ़ने में विफल). क्‍या आप पुन: प्रयास करना चाहते हैं?";
"Failure Resetting Source Image" = "क्षमा करें, कोई त्रुटि हुई (स्रोत छवि, %1$s रिवाइंड करने में विफल). क्‍या आप पुन: प्रयास करना चाहते हैं?";
"Failure Resetting Destination Device" = "क्षमा करें, कोई त्रुटि हुई (USB स्टिक, %1$s रिवाइंड करने में विफल). क्‍या आप पुन: प्रयास करना चाहते हैं?";
"Failure Ejecting" = "क्षमा करें, कोई त्रुटि आई (USB स्टिक निकालने में विफल). क्या आप पुन: प्रयास करना चाहते हैं?";

"Failure Try Again" = "पुन: प्रयास करें";
"Failure Quit" = "छोड़ें";

"Failure Termination Status" = "निष्कासन स्थिति %d";

"Failure Internal Error 1" = "अनपेक्षित EOF";
